#include <stdio.h>

int main(void)
{
    // // 다차원 배열 Multidimensional Array
    // int i; // ㅁ

    // int arr[5];
    // // ㅁㅁㅁㅁㅁ

    // int arr2[2][5];
    // // ㅁㅁㅁㅁㅁ
    // // ㅁㅁㅁㅁㅁ

    // // arr2[0][0] arr2[0][1] arr2[0][2] arr2[0][3] arr2[0][4]
    // // arr2[1][0] arr2[1][1] arr2[1][2] arr2[1][3] arr2[1][4]

    // int arr3[4][2];
    // // ㅁㅁ
    // // ㅁㅁ
    // // ㅁㅁ
    // // ㅁㅁ

    // int arr4[3][3][3];
    // // ㅁㅁㅁ [000][001][002]
    // // ㅁㅁㅁ [010][011][012]
    // // ㅁㅁㅁ [020][021][022]

    // // ㅁㅁㅁ [100][101][102]
    // // ㅁㅁㅁ [110][111][112]
    // // ㅁㅁㅁ [120][121][122]

    // // ㅁㅁㅁ [200][201][202]
    // // ㅁㅁㅁ [210][211][212]
    // // ㅁㅁㅁ [220][221][222]

    // int arr[5] = {1,2,3,4,5};
    
    // int arr2[2][5] = 
    // {
    //     {1,2,3,4,5},
    //     {1,2,3,4,5}
    // };
    
    int arr3[4][2] = 
    {
        {1,2},
        {1,2},
        {1,2},
        {1,2},
        {1,2}
    };
    
    int arr4[3][3][3] = 
    {
        {
            {1,2,3},
            {1,2,3},
            {1,2,3}
        },
        {
            {11,12,13},
            {11,12,13},
            {11,12,13}
        },
        {
            {21,22,23},
            {21,22,23},
            {21,22,23}
        }
    };

    for (int i=0; i<4; i++)
    {
        for (int j=0; j<2; j++)
        {
            printf("2차원배열 (%d, %d)의 값: %d\n",i,j,arr3[i][j]);
        }
        printf("\n");
    }

    for (int i=0; i<3; i++)
    {
        for (int j=0; j<3; j++)
        {
            for(int k=0; k<3; k++)
            {
                printf("3차원배열 (%d %d %d)의 값: %d\n",i,j,k,arr4[i][j][k]);
            }
            printf("\n");
        }
    }
    return 0;
}